import { createServer } from "miragejs";

export const runApi = () =>
  createServer({
    routes() {
      this.get("https://localhost:3000/api/project-info", () => {
        return {
          name: "Допомога для Кості Цимбала",
          description: ` Ми збираємо гроші на нові труси для Кості Цимбала, йому терміново потрібні нові, бо старі він вмудрився обісрати.
          Це дуже довга історія про те як він обісрав свої труси, але якщо коротко, він випив хуйового вина во Франціі, після чого, коли він пішов у музей, він обісрався від хуйового вина.
          Люди, не будьте байдужими, кожна гривня буде корисна, бо грошей на нові труси у Кості немає, мінімальна ціна на труси у Франціі - 100 євро, тому ми відкрили збір на 3000 гривень, що є 100 євро.`,
          amount: 1000,
          goal: 3000,
          requisites: { mono: "1488 1488 1488 1488" },
        };
      });
    },
  });
